In [35]:
import pandas as pd
from sqlalchemy import create_engine, text

# Creazione connessione al database (PostgreSQL in questo caso)
engine = create_engine('postgresql+psycopg2://postgres:mypassword@localhost:5432/esercizio')

with engine.begin() as conn:
    conn.execute(text("""
        DROP TABLE IF EXISTS studenti;
        CREATE TABLE studenti (
            id SERIAL PRIMARY KEY,
            studente VARCHAR(50) NOT NULL,
            materia VARCHAR(50) NOT NULL,
            voti INTEGER[] NOT NULL
        );
    """))

In [36]:
# Inserimento di alcuni dati di esempio (id, studente, materia, voti)
# Nota: i voti sono memorizzati come array di interi
# Per semplicit√†, usiamo un array di voti per ogni studente
data = [
    {'id': 1, 'studente': 'Alice', 'materia': 'Matematica', 'voti': [28, 30, 26]},
    {'id': 2, 'studente': 'Bob', 'materia': 'Fisica', 'voti': [22, 24, 30]},
    {'id': 3, 'studente': 'Charlie', 'materia': 'Chimica', 'voti': [18, 20, 15]},
    {'id': 4, 'studente': 'David', 'materia': 'Biologia', 'voti': [30, 29, 28]},
    {'id': 5, 'studente': 'Eve', 'materia': 'Informatica', 'voti': [30, 30, 30]},
]

with engine.begin() as conn:
    for studente in data:
        conn.execute(text("""
            INSERT INTO studenti (studente, materia, voti)
            VALUES (:studente, :materia, :voti)
            ON CONFLICT (id) DO NOTHING;
        """), studente)

query = "SELECT * FROM studenti"
tabella = pd.read_sql(query, engine)
tabella

   id studente      materia          voti
0   1    Alice   Matematica  [28, 30, 26]
1   2      Bob       Fisica  [22, 24, 30]
2   3  Charlie      Chimica  [18, 20, 15]
3   4    David     Biologia  [30, 29, 28]
4   5      Eve  Informatica  [30, 30, 30]

In [37]:
# calcola la media dei voti per ogni studente
with engine.begin() as conn:
    result = conn.execute(text("""
        SELECT s.studente, s.materia, AVG(voto) AS media_voti
        FROM studenti s,
        LATERAL unnest(s.voti) AS voto
        GROUP BY s.studente, s.materia;
    """))
    media_voti = pd.DataFrame(result.fetchall(), columns=result.keys())

media_voti

  studente      materia           media_voti
0      Bob       Fisica  25.3333333333333333
1  Charlie      Chimica  17.6666666666666667
2    David     Biologia  29.0000000000000000
3    Alice   Matematica  28.0000000000000000
4      Eve  Informatica  30.0000000000000000

In [38]:
# aggiungi la media dei voti alla tabella degli studenti in una nuova colonna
with engine.begin() as conn:
    conn.execute(text("""
        ALTER TABLE studenti ADD COLUMN media_voti FLOAT;
    """))
with engine.begin() as conn:
    for index, row in media_voti.iterrows():
        conn.execute(text("""
            UPDATE studenti
            SET media_voti = :media_voti
            WHERE studente = :studente AND materia = :materia;
        """), {'media_voti': row['media_voti'], 'studente': row['studente'], 'materia': row['materia']})

# visualizza la tabella aggiornata degli studenti
tabella_aggiornata = pd.read_sql(query, engine)
tabella_aggiornata = tabella_aggiornata.sort_values(by='id')
tabella_aggiornata

   id studente      materia          voti  media_voti
3   1    Alice   Matematica  [28, 30, 26]   28.000000
0   2      Bob       Fisica  [22, 24, 30]   25.333333
1   3  Charlie      Chimica  [18, 20, 15]   17.666667
2   4    David     Biologia  [30, 29, 28]   29.000000
4   5      Eve  Informatica  [30, 30, 30]   30.000000

In [40]:
# altera la tabella per separare i voti in colonne separate
with engine.begin() as conn:
    conn.execute(text("""
        ALTER TABLE studenti
        ADD COLUMN voto1 INTEGER,
        ADD COLUMN voto2 INTEGER,
        ADD COLUMN voto3 INTEGER;
    """))
with engine.begin() as conn:
    for index, row in tabella_aggiornata.iterrows():
        conn.execute(text("""
            UPDATE studenti
            SET voto1 = :voto1, voto2 = :voto2, voto3 = :voto3
            WHERE id = :id;
        """), {'voto1': row['voti'][0], 'voto2': row['voti'][1], 'voto3': row['voti'][2], 'id': row['id']})

# visualizza la tabella aggiornata con i voti separati
tabella_voti_separati = pd.read_sql(query, engine)
tabella_voti_separati = tabella_voti_separati.sort_values(by='id')
tabella_voti_separati

   id studente      materia          voti  media_voti  voto1  voto2  voto3
0   1    Alice   Matematica  [28, 30, 26]   28.000000     28     30     26
1   2      Bob       Fisica  [22, 24, 30]   25.333333     22     24     30
2   3  Charlie      Chimica  [18, 20, 15]   17.666667     18     20     15
3   4    David     Biologia  [30, 29, 28]   29.000000     30     29     28
4   5      Eve  Informatica  [30, 30, 30]   30.000000     30     30     30

In [41]:
# rimuovi la colonna voti
with engine.begin() as conn:
    conn.execute(text("""
        ALTER TABLE studenti DROP COLUMN voti;
    """))

# visualizza la tabella finale degli studenti
tabella_finale = pd.read_sql(query, engine)
tabella_finale = tabella_finale.sort_values(by='id')
tabella_finale

   id studente      materia  media_voti  voto1  voto2  voto3
0   1    Alice   Matematica   28.000000     28     30     26
1   2      Bob       Fisica   25.333333     22     24     30
2   3  Charlie      Chimica   17.666667     18     20     15
3   4    David     Biologia   29.000000     30     29     28
4   5      Eve  Informatica   30.000000     30     30     30

In [42]:
# esporta in un file SQLite 
import sqlite3
connsqlite = sqlite3.connect('esercizio.db')
df = pd.read_sql("SELECT * FROM studenti", engine)
df.to_sql('studenti', connsqlite, if_exists='replace', index=False)
connsqlite.close()